#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <string.h>


//1.算数操作符
//+    -   *   /   %
//对于 / ，如果两个操作符都为整数，执行整数除法，只要有浮点数执行的就是浮点数除法
// % 操作符的两个操作数必须为整数



//2.移位操作符
//<< 左移操作符
//>> 右移操作符
//移位操作符的操作数只能是整数

//移位操作符，移动的是二进制
//移位操作符，移动的是存储在内存中的 补码

//int main()
//{
//	//int a = 4;
//	//00000000 00000000 00000000 00000100 - 4的原码、反码、补码
//	int a = -4;
//	//10000000 00000000 00000000 00000100 - -4的原码
//	//11111111 11111111 11111111 11111011 - -4的反码
//	//11111111 11111111 11111111 11111100 - -4的补码
//	
//	int b = a << 1;//把a向左移动一位
//	//左移操作符 - 左边丢弃，右边补0
//	//00000000 00000000 00000000 00001000 - 
//	// 
//	//11111111 11111111 11111111 11111100 - b中存储的补码
//	//11111111 11111111 11111111 11111011 - b的反码
//	//10000000 00000000 00000000 00000100 - b的原码 -8
//	
//
//	printf("%d %d", a, b);
//	return 0;
//}

//int main()
//{
//	int a = -4;
//	//10000000 00000000 00000000 00000100 - -4的原码
//	//11111111 11111111 11111111 11111011 - -4的反码
//	//11111111 11111111 11111111 11111100 - -4的补码
//	
//	int b = a >> 1;//把a向右移动一位
//	//右移操作符
//	//逻辑右移 - 右边丢弃，左边补0
//	//算数右移 - 右边丢弃，左边补原符号位
//	//取决于编译器
//
//	//11111111 11111111 11111111 11111110 - b中存储的补码
//	//11111111 11111111 11111111 11111101 - b的反码
//	//10000000 00000000 00000000 00000010 - b的原码 -2
//	
//
//	printf("%d %d", a, b);
//	return 0;
//}

//移位操作符，禁止移动负数位，这个是标准未定义的



//3.位操作符 - 操作数必须是整数
//& 按位与
//| 按位或
//^ 按位异或
//二级制位

//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a & b; //& - 按(2进制)位与
//	//00000000 00000000 00000000 00000011 - 3的补码
//	//10000000 00000000 00000000 00000101 - -5的原码
//	//11111111 11111111 11111111 11111010 - -5的反码
//	//11111111 11111111 11111111 11111011 - -5的补码
//
//	//00000000 00000000 00000000 00000011
//	//11111111 11111111 11111111 11111011
//	//00000000 00000000 00000000 00000011 - 3
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a | b; //| - 按(2进制)位或
//	//00000000 00000000 00000000 00000011 - 3的补码
//	//10000000 00000000 00000000 00000101 - -5的原码
//	//11111111 11111111 11111111 11111010 - -5的反码
//	//11111111 11111111 11111111 11111011 - -5的补码
//
//	//00000000 00000000 00000000 00000011
//	//11111111 11111111 11111111 11111011
//	//11111111 11111111 11111111 11111011
//	//11111111 11111111 11111111 11111010
//	//10000000 00000000 00000000 00000101 - -5
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a ^ b; //^ - 按(2进制)位异或
//	//异或的运算：相同为0，相异为1
//	//00000000 00000000 00000000 00000011 - 3的补码
//	//10000000 00000000 00000000 00000101 - -5的原码
//	//11111111 11111111 11111111 11111010 - -5的反码
//	//11111111 11111111 11111111 11111011 - -5的补码
//
//	//00000000 00000000 00000000 00000011
//	//11111111 11111111 11111111 11111011
//	//11111111 11111111 11111111 11111000
//	//11111111 11111111 11111111 11110111
//	//10000000 00000000 00000000 00001000 - -8
//
//	return 0;
//}

//面试题
//不创建临时变量（第三个变量）实现两个数的变换
//a^0=a
//a^a=0
//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	//思路一
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//
//	//思路二
//	a = a ^ b;
//	b = a ^ b; //b = a^b^b = a
//	a = a ^ b; //a = a^b^a = b
//
//
//	return 0;
//}

//练习一
//求一个整数存储在内存中的二进制中1的个数
//int main()
//{
//	int num = 10;
//	int count = 0;
//	while (num)
//	{
//		if (num % 2 == 1)
//			count++;
//		num = num / 2;
//	}
//	printf("%d", count);
//	return 0;
//}



//4.赋值操作符 - =
//int main()
//{
//	int a = 10;
//	int b = 0;
//	b = a = a + 3;//连续赋值
//	printf("a=%d b=%d", a, b);
//	return 0;
//}

//复合赋值符
//int main()
//{
//	int a = 1;
//	a >>= 1;
//	a += 1;
//	return 0;
//}



//5.单目操作符
//!  逻辑反操作
//-  负值
//+  正值
//&  取地址
//sizeof   操作数的类型长度（以字节为单位）
//~  对一个数的二进制按位取反
//-- 前置、后置--
//++ 前置、后置++
//*  间接访问操作符(解引用操作符)
//(类型)  强制类型转换

//int main()
//{
//	int flag = 0;
//	if (!flag)
//	{
//		printf("hehe");
//	}
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	char c = 0;
//
//	//printf("%p\n", &a);
//	//printf("%p\n", &c);
//
//	int* pa = &a;//取地址操作符
//	*pa = 20;    //解引用操作符
//
//
//	return 0;
//}

//野指针- 指针没有明确的指向，指针的空间不属于你

//int main()
//{
//	int a = 10;
//	int* pa;
//	int arr[10];
//
//	printf("%zu\n", sizeof(a));
	//printf("%zu\n", sizeof a);
	//printf("%zu\n", sizeof (int));
	//printf("%zu\n", sizeof int); //err
//	printf("%zu\n", sizeof(pa));
//	printf("%zu\n", sizeof(arr));
//	printf("%zu\n", sizeof(arr[0]));
//	return 0;
//}

//int main()
//{
//	short s = 10;
//	int a = 2;
//	printf("%zu\n", sizeof(s = a + 5));
//	printf("%d\n", s);
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	//00000000 00000000 00000000 00000000
//	//11111111 11111111 11111111 11111111 - 内存中的补码
//	//10000000 00000000 00000000 00000001 - -1
//	printf("%d\n", ~a);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	//a = a | (1 << 2);
//	int n = 0;
//	scanf("%d", &n);
//	a = a | (1 << (n - 1));
//	//把a的第N位置为1
//	printf("a=%d\n", a);
//
//	a = a & ~(1 << (n - 1));
//	printf("a=%d\n", a);
//
//	//00000000 00000000 00000000 00001010
//	//00000000 00000000 00000000 00000100
//	//1<<2
//	//00000000 00000000 00000000 00001110
//	//11111111 11111111 11111111 11101111
//	//00000000 00000000 00000000 00010000
//
//	return 0;
//}

//int main()
//{
//	int a = (int)3.14;
//	printf("%d\n", a);
//	return 0;
//}



//6.关系操作符
// > >= < <= != ==



//7.逻辑操作符
//&& 逻辑与
//|| 逻辑或
//int main()
//{
//	int a = 3;
//	int b = 0;
//	if (a && b)
//	{
//		printf("hehe\n");
//	}
//	if (a || b)
//	{
//		printf("haha\n");
//	}
//
//	return 0;
//}

//360笔试题
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++; //a++确定为0，后面的不再计算 - 短路
//	//i = a++ || ++b || d++;
//	printf("a=%d\n b=%d\n c=%d\n d=%d\n", a, b, c, d);
//	return 0;
//}



//8.条件操作符 - 三目操作符
//exp1 ? exp2 :exp3
//int main()
//{
//	int a = 3;
//	int b = 0;
//	b = ((a > 5) ? 3 : -3);
//	return 0;
//}



//9.逗号表达式
//用逗号隔开的多个表达式
//从左向右依次执行，整个表达式的结果是最后一个表达式的结果




//10.下标引用、函数调用和结构成员
//int main()
//{
//	int arr[10];
//	
//	arr[4] = 5;
//	//[]下标引用操作符
//	//两个操作数 - arr 4
//
//	return 0;
//}

//void test(int x, int y)
//{
//
//}
//int main()
//{
//	test(3, 4);
//	//()函数调用操作符
//	//操作数 - test 3 4
//	return 0;
//}

//书：书名+定价
//struct Book
//{
//	char name[10];
//	int price;
//};
//int main()
//{
//	struct Book sb = { "pengge",55 };
//	printf("%s %d", sb.name, sb.price); //结构体变量.结构体成员名
//
//	struct Book* ps = &sb;
//	printf("%s %d", (*ps).name, (*ps).price);
//	printf("%s %d", ps->name, ps->price); //结构体指针->结构体成员名
//
//	return 0;
//}



//11.表达式求值

//隐式类型转换
//C的整型算数运算总是至少以缺省整型类型的精度来进行的
//为了获得这个精度，表达式中的 字符 和 短整型 操作数在使用之前被转换为 普通整型，这种转换称为 整型提升

//int main()
//{
//	char a = 5;
//	char b = 126;
//	char c = a + b;
//	//00000000 00000000 00000000 00000101
//	//00000101 - a
//	//00000000 00000000 00000000 01111110
//	//01111110 - b
//	//
//	//整型提升
//	//00000000 00000000 00000000 00000101 - a
//	//00000000 00000000 00000000 01111110 - b
//	//00000000 00000000 00000000 10000011
//	//10000011 - c
//	printf("%d", c);
//	//%d 十进制的方式打印有符号整数
//	//10000011
//	//11111111 11111111 11111111 10000011
//	//10000000 00000000 00000000 01111100
//	//10000000 00000000 00000000 01111101
//	//-125
//	return 0;
//}

//无符号整型提升，高位补0

//算数转化
//如果某个操作符的各个操作数属于不同的类型，那么除非其中一个操作数转换为另一个操作数的类型
//否则操作就无法进行

//寻常算数转换
//long double
//double
//float
//unsigned long int
//long int
//unsigned int
//int

//操作符的属性
//1.操作符的优先级
//2.操作符的结合性
//3.是否控制求值顺序

